using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Linq;
using System.Reflection.Emit;
using System.Text;
using System.Threading.Tasks;

namespace Lab2_OOP
{

    class Program
    {
         static int Main(string[] args)
        {
            //Определение переменных всех возможных примитивных типов

            //<---------------------------------------------------------------------------------------------------------------------------------------------------------------->
            /*целое число - 4 байта*/
            int i = -4;
            /*логический литерал*/
            bool b = false;
            /*целое число - 2 байта*/
            short s = 2;
            /*целое натуральное число число - 1 байт*/
            byte by = 1;
            /*целое число - 1 байт*/
            sbyte sby = -1;
            /*целое натуральное число - 2 байта*/
            ushort us = 2;
            /*целое натуральное число число - 4 байта*/
            uint ui = 4;
            /*целое число - 8 байт*/
            long l = 8;
            /*целое натуральное число число - 8 байт*/
            ulong ulo = 8;
            /*одиночный символ в кодировке Unicode - 2 байта*/
            char c = 'A';
            /*число с плавающей точкой - 4 байта*/
            float f = 3.4f;
            /*число с плавающей точкой двойной точности - 8 байта*/
            double d = 3e10;
            /*набор символов unicode*/
            string str = "Доброе утро!";
            /*десятичное дробное число*/
            decimal dec = 3.4m;
            /*значение любого типа данных - занимает 4 байта на 32-разрядной платформе и 8 байт на 64-разрядной платформе*/
            object obj = 22.5;
            //<---------------------------------------------------------------------------------------------------------------------------------------------------------------->







        }


    }
}